/* 
1. Callback & Higher-Order Function มีข้อดีอย่างไร
Answer: มีข้อดีคือสามารถเรียกให้แสดงผลลัพธ์เมื่อชุดข้อมูลมีหลายชุด โดยไม่ต้องเขียน fuction การทำงานแยกของแต่ละชุด ลดการซ้ำซาก


2. จากการลองใช้ Callback Function ในระบบเกมและระบบแจ้งเตือน คุณคิดว่าโค้ดอ่านง่ายขึ้นหรือไม่ เพราะอะไร 
Answer: อ่านง่ายขึ้น แต่สำหรับมือใหม่อาจจะต้องใช้เวลาในการโยงความสัมพันธ์ของการทำงานแต่ละตัวเล็กน้อย


3. หากต้องสอนเพื่อนให้เข้าใจ Callback & Higher-Order Function ใน 5 นาที จะอธิบายอย่างไร 
Answer:  callback เป็นเหมือน template สำเร็จรูปที่เราเขียนไว้เพื่อเราจะกลับมาเรียกใช้ภายหลัง แล้วจะเรียกใช้ยังไง? ก็ต้องมี HoF ซึ่งเป็นเหมือน"หัวหน้า"ที่จะไป"เลือก"ว่าควรเรียกใช้ template ไหน(ในกรณีที่มีหลายตัว) ที่เราเขียนไว้แล้วก็เอามาแสดงผลให้ โดยจะมอง callback และ HoF เป็นโรงงานแห่งนึงเลยก็ได้ พอเซ็ทระบบเสร็จ เราก็เรียกใช้หลายๆครั้งได้เลย


*/
